<a href="https://colab.research.google.com/github/trankha1655/CS114_ML/blob/main/CS114_ML/Colab%20Research/Du_doan_diem_cuoi_ki_NMLT.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# IMPORT DỮ LIỆU

Kết nối với google drivedrive

In [136]:
from google.colab import drive
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

Import các thư viện cần thiết cho quá trình đánh giá và tiền xử lý dữ liệu

In [137]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

Đọc dữ liệu từ đường dẫn đến thư mục chứa dữ liệu trong google drive

In [138]:
data = pd.read_csv('/content/gdrive/MyDrive/NMLT/wecode.csv')
score = pd.read_csv('/content/gdrive/MyDrive/NMLT/score_training.csv')

In [139]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264606 entries, 0 to 264605
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             264606 non-null  int64
 1   assignment_id  264606 non-null  int64
 2   problem_id     264606 non-null  int64
 3   user_id        264606 non-null  int64
 4   is_final       264606 non-null  int64
 5   status         264605 non-null  object
 6   pre_score      264606 non-null  int64
 7   coefficient    264606 non-null  object
 8   file_name      264606 non-null  object
 9   language_id    264606 non-null  int64
 10  created_at     264606 non-null  object
 11  updated_at     264606 non-null  object
dtypes: int64(7), object(5)
memory usage: 24.2+ MB

In [140]:
data.head(10)

   id  assignment_id  ...           created_at           updated_at
0   4              0  ...  2020-10-30 10:58:11  2020-10-30 10:58:19
1   5              0  ...  2020-10-30 11:07:09  2020-10-30 11:07:17
2   6              0  ...  2020-10-30 11:08:01  2020-10-30 11:23:36
3   7              0  ...  2020-10-30 11:11:41  2020-10-30 11:11:42
4   8              0  ...  2020-10-30 11:15:06  2020-10-30 11:15:07
5   9              0  ...  2020-10-30 11:16:57  2020-10-30 11:16:58
6  10              0  ...  2020-10-30 11:18:47  2020-10-30 11:18:55
7  11              0  ...  2020-10-30 11:20:07  2020-10-30 11:20:15
8  12              0  ...  2020-10-30 11:21:02  2020-10-30 11:21:10
9  13              0  ...  2020-10-30 11:21:36  2020-10-30 11:21:44

[10 rows x 12 columns]

In [141]:
score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 975 entries, 0 to 974
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      975 non-null    int64
 1   QT      973 non-null    object
 2   GK      974 non-null    object
 3   TH      974 non-null    object
 4   CK      974 non-null    object
 5   TBM     974 non-null    object
 6   TBTL    974 non-null    object
dtypes: int64(1), object(6)
memory usage: 53.4+ KB

# TIỀN XỬ LÝ DỮ LIỆU

Loại bỏ các cột không cần thiết cho bài tập này

In [142]:
score = score.drop(columns = ['QT','GK','TH','TBM','TBTL'])
data = data.drop(columns=['id', 'created_at', 'updated_at', 'file_name', 'language_id'])

In [143]:
score = score.replace(r'^\s*$', np.NaN, regex=True) #Chuyển giá trị trống thành NaN
score.info()
score.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 975 entries, 0 to 974
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      975 non-null    int64
 1   CK      920 non-null    object
dtypes: int64(1), object(1)
memory usage: 15.4+ KB

   id   CK
0  22  8.5
1  24  9.5
2  27   10
3  28  9.5
4  29  8.5

In [144]:
data.head()

   assignment_id  problem_id  user_id  ...             status pre_score  coefficient
0              0           3        4  ...              SCORE     10000          100
1              0           4        4  ...              SCORE     10000          100
2              0           5        4  ...  Compilation Error         0          100
3              0           5        4  ...  Compilation Error         0          100
4              0           5        4  ...  Compilation Error         0          100

[5 rows x 7 columns]

In [145]:
user_status = data[['user_id','is_final','pre_score']]
user_status

        user_id  is_final  pre_score
0             4         1      10000
1             4         1      10000
2             4         0          0
3             4         0          0
4             4         0          0
...         ...       ...        ...
264601     1796         0          0
264602     1796         0          0
264603     1796         1      10000
264604      255         1       6250
264605     1568         0      10000

[264606 rows x 3 columns]

Đếm số bài nộp đã hoàn thành tối đa điểm của mỗi user_id

In [146]:
user_accepted_submit =  user_status[user_status['is_final'] == 1][user_status['pre_score'] == 10000]
user_accepted_submit = user_accepted_submit.groupby('user_id').sum()
user_accepted_submit = user_accepted_submit.drop(columns = 'pre_score')
user_accepted_submit

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

         is_final
user_id
1               1
4              37
5               3
6              85
11              9
...           ...
1860           28
1862            4
1864           28
1865           10
1868           27

[1139 rows x 1 columns]

Đếm số problem của mỗi assignment

In [147]:
problem_assginment = data[['assignment_id','problem_id']]
problem_assginment = problem_assginment.groupby(by='assignment_id', as_index=False).agg({'problem_id': pd.Series.nunique})
problem_assginment.rename(columns={'problem_id':'total_problems'},inplace = True)
problem_assginment

     assignment_id  total_problems
0                0             352
1                5               4
2                7              10
3                8               8
4               10               7
..             ...             ...
285            376              10
286            377               7
287            381               4
288            383              47
289            384               4

[290 rows x 2 columns]

Đếm số lượng problem mà mỗi user_id phải làm

In [148]:
problems_user = problem_assginment.merge(data[['assignment_id','user_id']],on = 'assignment_id').sort_values(by = ['user_id'])
problems_user = problems_user.drop_duplicates(subset = ['user_id','assignment_id']) #Bỏ các hàng có assignment_id và user_id trùng nhau
problems_user = problems_user.groupby('user_id')['total_problems'].sum().to_frame()
problems_user

         total_problems
user_id
1                   352
4                   352
5                    48
6                   364
7                   352
...                 ...
1860                 78
1862                 15
1864                 75
1865                 29
1868                367

[1159 rows x 1 columns]

In [160]:
user_final_summery = problems_user.join(user_accepted_submit, on = 'user_id',how = 'left')
user_final_summery.rename(columns={'is_final':'total_final'}, inplace=True)
user_final_summery

         total_problems  total_final
user_id
1                   352          1.0
4                   352         37.0
5                    48          3.0
6                   364         85.0
7                   352          NaN
...                 ...          ...
1860                 78         28.0
1862                 15          4.0
1864                 75         28.0
1865                 29         10.0
1868                367         27.0

[1159 rows x 2 columns]

Bảng trên chỉ mới hiển thị số bài đã hoàn thành và số bài mà mỗi user_id phải làm có trong file wecode. Ta cần phải lấy tiếp các user_id có trong file score_training để có đầy đủ thông tin của các user_id.